Repository: 84000/data-translation-memory
Catalog: toh145-v4.tmx
Source language: bo
Languages: en

source: །ཚད་མེད་གཞལ་ཡས་བསམ་གྱིས་མི་ཁྱབ་པའི། །སངས་རྒྱས་རྣམས་དང་ཕྲད་གྱུར་ཅི་འདྲ་བ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་སྟོན་པར་བྱེད།
en: “Those bodhisattvas should be taught How it is to meet infinite, incalculable, And inconceivable buddhas.

source: །ཏིང་འཛིན་གང་དག་ཇི་སྙེད་ཡོད་པ་དང་། །དེ་བཞིན་ཏིང་འཛིན་རྒྱུད་ཀྱི་རྣམ་པ་དག །དེ་དག་བདེ་གཤེགས་སྲས་ལ་རྗོད་པར་བྱེད།
en: “As many meditative absorptions as may exist, And likewise the absorptions that are aspects of their mindstream, Should be taught to the offspring of the sugatas.

source: །འཁོར་བའི་འཁོར་ལོ་རྣམ་པར་ཟློག་པ་དང་།
en: “To turn back the wheel of saṃsāra,

source: །དམ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་བསྐོར་བ།
en: To turn the wheel of the holy Dharma,

source: །འཇིག་རྟེན་ཀུན་གྱིས་རྟག་ཏུ་མ་བསྐོར་བ།
en: And never to be turned around by anyone in the world—

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་དེ་བསྟན་བྱ།
en: Bodhisattvas should be taught such things.

source: །ཤིན་ཏུ་སྡུག་བསྔལ་འཇིག་རྟེན་ཐམས་ཅད་དང་། །ངན་སོང་ས་རྣམས་དག་ཏུ་གནོད་གྱུར་པའི།། གནས་དང་སྐྱབས་དང་དཔུང་གཉེན་གྱུར་པ་དེ།
en: “To become, for all in worlds where sufferings are intense, And for those tormented in the places of the lower realms, Their basis, refuge, and defender—

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་བསྟན་པར་བྱ།
en: Bodhisattvas should be taught such things.

source: །གང་ཞིག་བྱང་ཆུབ་དོན་དུ་སེམས་འཇོག་པ།
en: “Those who have set their thoughts on the goal of awakening

source: །དེ་ནི་དང་པོའི་བྱང་ཆུབ་སེམས་དཔར་བསྟན།
en: Are, it is taught, beginner bodhisattvas.

source: །བསླབ་པའི་གདམས་ངག་ཇི་བཞིན་ངེས་བྱས་པ། །ཇི་བཞིན་རྣམ་པར་གཞག་འདི་དེ་ཡི་ཡིན།
en: The instructions for their training as they have been ascertained Are as they are detailed for them in this presentation.

source: །ནད་བྲལ་རྣམས་ཀྱི་བསྟན་པ་ཇི་བཞིན་དུ། །འཇིག་རྟེན་ཀུན་ལ་ཕན་པ་བྱ་བའི་ཕྱིར། །དེ་ལྟར་ཐོག་མ་སུ་ཞིག་སེམས་བསྐྱེད་པ།
en: “Those who, to begin with, have thus generated the thought of awakening For the sake of benefiting the entire world Just as is taught by those who are free from all ailments—

source: །འདི་ནི་གཉིས་ཏེ་དང་པོའི་ལས་ཅན་ནོ།
en: These are the second kind of bodhisattva: the fortunate beginners.

source: །ཕན་པ་ཐོབ་བྱེད་སེམས་དང་རབ་དང་བདེ།
en: “A mind that brings benefit, is good, and brings happiness,

source: །གཉེན་དང་སྡུག་དང་དེ་བཞིན་སྡུད་སེམས་དང་།
en: That is friendly, feels sadness, and likewise gathers together;

source: །ཀུན་དུ་བསྲུང་བའི་སེམས་དང་སྙོམས་པའི་སེམས། །སློབ་དཔོན་སེམས་དང་སྙོམས་པར་སྟོན་པའི་སེམས།
en: A mind that protects everything, a mind of equality, The mind of a teacher, and a mind that teaches equally—

source: །དེ་འདྲ་དག་ལ་སེམས་གནས་གྱུར་པ་དེ།
en: “Those who have in these ways transformed their mind

source: །ལུང་ནོད་ཁ་ཏོན་བྱེད་པར་སྦྱར་བར་བྱ།
en: Should apply themselves to hearing the scriptures and to the performance of recitations.

source: །མང་དུ་ཐོས་ནས་དགོན་པར་གནས་སུ་གཞུག
en: Once they are learned, they should devote themselves to retiring into solitude.

source: །དབེན་པར་གྱུར་ནས་དགེ་བཤེས་སྟེན་དུ་གཞུག
en: Having retired into solitude, they should devote themselves to serving their spiritual teacher.

source: །དགེ་བཤེས་རྣམས་ལ་བཀའ་བློ་བདེ་བར་བྱ།
en: “They should delight in following the instructions of their teachers.

source: །དུས་ཚོད་ཤེས་ལ་ཤེས་བཞིན་ལྡན་པར་བྱ།
en: In becoming aware of temporality, they should be conscientious.

source: །དུས་ཤེས་གྱུར་ནས་ཤིན་ཏུ་འཇིགས་མེད་བྱ།
en: Aware of temporality, they should become utterly fearless.

source: །འཇིགས་པ་མེད་ནས་དོན་ལ་བརྩོན་པར་བྱ།
en: Being fearless, they should exert themselves in knowing the meaning.

source: །དོན་ཤེས་གྱུར་ནས་དེ་བཞིན་ཆོས་བརྗོད་བྱ།
en: “Knowing the meaning, they should expound the Dharma likewise.

source: །ཆོས་རྣམས་ཀུན་ལ་རྨོངས་གྱུར་མེད་པར་བྱ།
en: Regarding all the teachings of Dharma, they should be without confusion.

source: །རྨོངས་པ་མེད་པར་གྱུར་ནས་རྒྱལ་བའི་སྲས།
en: Having become free of confusion, the offspring of the victors

source: །ལེགས་པར་གསུངས་པའི་ཆོས་ལ་གནས་པར་བྱ།
en: Should apply themselves to abiding in the well-taught Dharma.

source: །འདི་ནི་དང་པོའི་ལས་ཅན་བརྗོད་པ་སྟེ།
en: “These are what are called fortunate beginners—

source: །བྱང་ཆུབ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡིན།
en: Bodhisattvas who have entered the state of awakening.

source: །འདི་ནི་གདམས་པ་འདི་ནི་བསྟན་པ་སྟེ།
en: These are the instructions, and these the teachings;

source: །འདི་ལ་སུ་སློབ་དེ་ནི་སངས་རྒྱས་སྲས།
en: Those who train in them are the offspring of the Buddha.

source: །བྱང་ཆུབ་སེམས་དཔའ་གསུམ་པ་གང་ཡིན་པ།
en: “Bodhisattvas of the third kind are those

source: །ཆོས་ཀྱི་རྒྱལ་པོའི་བསྟན་ལ་རབ་ཏུ་སྦྱོར།
en: Who apply themselves to the teaching of the King of Dharma.

source: །མི་རྟག་ཉིད་དང་སྡུག་བསྔལ་སྟོང་ཉིད་དང་། །བདག་མེད་པ་དང་གཡོ་བ་མེད་པ་དང་། །དེ་བཞིན་ཆོས་འདི་ཐམས་ཅད་བདག་མིན་དང་། ། མངོན་པར་འདུ་བྱེད་མེད་དང་དབེན་པ་དང་།།
en: They should understand that all phenomena are impermanent, suffering, empty, Without self, and immovable; “Likewise that all these phenomena are not self, Are not produced, and are disengaged,

source: འདི་དག་ཐམས་ཅད་རྟོག་པ་མེད་ཡིན་པར།
en: And that they are all without conceptual thought;

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་རྟོག་པར་བྱེད།
en: Thus should bodhisattvas should understand things in this way.

source: །སེམས་ཅན་ཁམས་དང་ཆོས་ཀྱི་དབྱིངས་ལ་ཡང་།། བརྟག་པར་བྱ་ཕྱིར་དེ་ནི་གཟེངས་ཡང་བསྟོད།
en: “To have them examine the constitution of sentient beings and the dharmadhātu, The sublimity of these is praised,

source: །འཇིག་རྟེན་ཁམས་ནི་མཐའ་ཡས་མུ་མེད་ཅེས།
en: And they are told how the world realms are infinite and boundless

source: །དེ་ལྟར་དེ་ནི་དཔྱོད་དུ་གཞུག་པར་བྱ།
en: To engage them, too, in that investigation.

source: །འདི་ན་ས་དང་ཆུ་དང་དེ་བཞིན་མེ། །རླུང་དང་ནམ་མཁའ་ཇི་སྙེད་ཡོད་པ་དང་། །ཕྱོགས་ན་འདོད་དང་གཟུགས་དང་གཟུགས་མེད་པ། །དེ་དག་རྣམས་ལ་དེ་ནི་དཔྱོད་དུ་གཞུག །
en: “Earth, water, fire, and air, And the extent of space in all directions, The desire realm, form, and formless realms— All these they they should set about investigating.

source: རྒྱ་ཆེན་ཆོས་རྣམས་ཀུན་དང་ཁམས་རྣམས་ཀྱི། །རང་བཞིན་མ་ལུས་མཐར་ཐུག་བརྟག་བྱ་བ།
en: “Their pursuit to the end of investigating thus the natures Of the whole vast extent of phenomena and the realms without exception—

source: །དེ་ནི་སངས་རྒྱས་སྲས་པོ་སྦྱོར་བྱེད་ལ། །ཕན་པར་བྱ་ཕྱིར་རྗེས་སུ་བསྟན་པ་ཡིན།
en: It is to benefit them as they apply themselves to this That the offspring of the buddhas are instructed.

source: །བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བར་གང་སྐྱེས་པ།
en: “Any bodhisattvas who have taken rebirth

source: །བསྟན་ལ་སྐྱེས་ཤིང་རབ་ཏུ་འབྱུང་བར་བྱེད།
en: Have been born into the teachings and go forth.

source: །བློ་ལྡན་དེ་ནི་དངོས་མེད་དངོས་པོ་རྟོགས།
en: These intelligent ones understand entities to be the absence of entities.

source: །དམ་ཆོས་གནས་སུ་སྐྱེས་ཏེ་ལེགས་པར་སྐྱེས།
en: Born in the realm of the holy Dharma, they are well born.

source: །དེ་ནི་རང་གི་ས་ལས་ཡོངས་མི་ལྡོག
en: “They do not turn back from their own level.

source: །སངས་རྒྱས་མཐར་ཐུག་ཡིན་པར་འཛིན་པ་སྐྱེ།
en: The conviction arises that buddhahood is the ultimate.

source: །རྟག་ཏུ་ཆོས་ལ་ངེས་པར་སེམས་དང་ལྡན།
en: They constantly have a mind that ascertains the Dharma,

source: །སེམས་ཅན་རང་བཞིན་ཅི་འདྲར་རྣམ་པར་དཔྱོད།
en: And they investigate what the nature of sentient beings is like.

source: །ལས་དང་འཇིག་རྟེན་དག་དང་ཞིང་རྣམས་དང་། །རྣམ་པར་སྨིན་དང་འཁོར་དང་མྱ་ངན་འདས། །རྣམ་པར་དབྱེ་བ་རྒྱལ་བའི་སྲས་ཀྱིས་ཤེས།
en: “The offspring of the victors know deeds, the worlds and realms, Karmic ripening, and saṃsāra and nirvāṇa And their differentiations.

source: །དེ་ཐུགས་སྐྱེས་པའི་བྱང་ཆུབ་སེམས་དཔར་བརྗོད།
en: Such things have been taught to bodhisattvas who have produced an awakened mind.

source: །ཐམས་ཅད་མཁྱེན་པ་འདས་དང་བྱུང་རྣམས་དང་། །མ་བྱོན་དག་ཀྱང་ཆོས་རྣམས་རྣམ་དཔྱད་ནས།
en: “Having investigated the qualities of the omniscient ones Of past, present, and future,

source: །གྲུབ་དང་གང་ཡང་ལེགས་སྐྱེས་མཐར་ཐུག་དང་།
en: Then the accomplishments, the ultimate rewards,

source: །རང་བྱུང་རྣམས་ཀྱི་གྲུབ་པ་ཅི་འདྲ་བ།
en: And the self-arisen accomplishments

source: །སངས་རྒྱས་དམ་པ་དེ་དག་ཐམས་ཅད་ནི།
en: “Of all those supreme buddhas,

source: །དུས་གསུམ་མཉམ་ཉིད་རྗེས་སུ་ཞུགས་པ་ཤེས།
en: These bodhisattvas are known to be attuned to the sameness of the three times.

source: །ནམ་ཡང་མཉམ་ཉིད་བྱེ་བྲག་འབྱེད་མི་བྱེད།
en: Supreme buddhas never differentiate this sameness into categories,

source: །དེ་ནི་དུས་གསུམ་ཐ་དད་མེད་པར་འཇུག
en: And they are attuned to the three times as undifferentiated.

source: །གང་གི་ཕན་ཡོན་རྣམ་པ་འདི་འདྲ་བ།
en: “Those endowed with benefits of this sort

source: །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་བཞི་པ་སྟེ།
en: Are the fourth kind of bodhisattva.

source: །འདི་དག་རབ་བསྒྲུབས་བྱང་ཆུབ་སེམས་དཔའ་དེ།
en: Bodhisattvas who fully accomplish this

source: །བྱང་ཆུབ་དོན་དུ་ངེས་པར་འབྱུང་བར་འགྱུར།
en: Will leave everything behind for the sake of awakening.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་པ་སྟེ།
en: “The fifth kind of bodhisattva

source: །སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པར་བརྗོད་པ་ཡིན།
en: Is specified as those who have perfected application.

source: །ཐབས་ལ་མཁས་པའི་རྗེས་སུ་ཞུགས་པ་སྟེ།
en: They have engaged in skill in means.

source: །བསོད་ནམས་ལས་དག་བརྩམས་པས་མཐར་ཕྱིན་བྱེད།
en: By accomplishing the meritorious practices, they perfect them.

source: །དེ་ལྟར་བསོད་ནམས་རབ་ཏུ་ཅི་བྱེད་ཀྱང་།
en: “Thus, whatever merit they produce

source: །འཇིག་རྟེན་ཀུན་གྱི་རྟེན་དུ་འགྱུར་བ་དང་།
en: Is done in order to become the support of all the world,

source: །ཕན་པར་འདོད་དང་བདེ་བ་ཐོབ་བྱེད་དང་།
en: With the desire to help others attain happiness,

source: །སྙིང་བརྩེ་བ་དང་སྐྱེ་དགུ་དགྲོལ་འགྱུར་བྱེད།
en: With kindness, and in order to emancipate all living beings.

source: །འཇིག་རྟེན་གནོད་གྱུར་གདུལ་བར་བྱ་བའི་ཕྱིར།
en: “In order to tame what harms the world

source: །འདྲེན་པར་བྱེད་ཅིང་རབ་ཏུ་དང་བར་བྱེད།
en: They guide and inspire lucid conviction.

source: །སེམས་ཅན་མང་པོ་ཐམས་ཅད་གདུལ་འདོད་དང་།
en: They wish to train all the many sentient beings

source: །མྱ་ངན་འདས་པའི་སེམས་ཀྱིས་མཐུ་ཡང་ཆེ།
en: And strongly wish to establish others in nirvāṇa.

source: །འཇིག་རྟེན་ཐམས་ཅད་མཐའ་མ་མེད་པ་དང་།
en: “They understand that the entire world of sentient beings is boundless

source: །དེ་བཞིན་དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད་དང་།
en: And, similarly, that it is inestimable, innumerable,

source: །མཚུངས་མེད་བསམ་ཡས་མཉམ་མེད་གཞལ་ཡས་དང་།
en: Incomparable, inconceivable, immeasurable,

source: །སྟོང་པ་མི་གཡོ་མེད་པའི་རང་བཞིན་ཤེས།
en: Empty, immovable, and of a nonexistent nature.

source: །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་པ་སྟེ།
en: “They are bodhisattvas of the fifth kind—

source: །སྦྱོར་བ་ཀུན་ཚོགས་ཕན་དང་སྙིང་བརྩེ་ལྡན།
en: Those who have perfected application and who are beneficial and kind.

source: །དེ་ལ་རྗེས་སུ་བསྟན་པ་འདི་འདྲ་སྟེ།
en: Their teaching is like this,

source: །ཡོན་ཏན་ཀུན་དང་ལྡན་པ་རྣམས་ཀྱིས་བསྟན།
en: Taught by those endowed with all good qualities.

source: །དེ་ནི་སེམས་ཅན་མཐའ་ཡས་ཐམས་ཅད་དང་། །ཆོས་ཀྱི་ངོ་བོ་ཉིད་ལ་རྨོངས་པ་མེད།
en: “They have no confusion regarding all infinite sentient beings And the essential nature of phenomena.

source: །ཤིན་ཏུ་བློ་ལྡན་རྟོག་བྲལ་རྣམ་རྟོག་མེད།
en: These highly intelligent ones are free of conceptual thought and without conceptions,

source: །འཇིག་རྟེན་ལྷ་དང་བཅས་པས་དབྱེར་མི་ཕྱེད།
en: And together with the gods of the world they do not differentiate.

source: །སངས་རྒྱས་ཆོས་དང་བྱང་ཆུབ་སེམས་དཔའ་དང་།
en: “The Buddha, the Dharma, bodhisattvas,

source: །སྤྱོད་པའི་བསྔགས་དང་བསྔགས་པ་མ་ཡིན་དང་། །
en: And bodhisattvas’ conduct—whether they are praised or not,

source: སེམས་ཅན་ཆུང་ངམ་ཡང་ན་ཆེའོ་ཞེས།
en: And whether they are told that sentient beings are vast or of small extent,

source: །ཐོས་པར་གྱུར་ཀྱང་བསམ་ལས་ནུར་བ་མེད།
en: These bodhisattvas should not let these things escape from his mind.

source: །སེམས་ཅན་ཉོན་མོངས་ཅན་ནམ་རྣམ་དག་གམ།
en: “And whether sentient beings are said to be defiled or be pure,

source: །གདུལ་སླ་ཞེའམ་གདུལ་བར་དཀའ་ཞེའམ།
en: Or whether they are said to be difficult or easy to train,

source: །ཆོས་དབྱིངས་ཆུང་ཞེའམ་ཡང་ན་རྒྱ་ཆེ་ཞེའམ།
en: Whether the dharmadhātu is said to be little or vast,

source: །འཇིག་པར་འགྱུར་ཞེའམ་འཆགས་པར་འགྱུར་ཞེ་འམ།
en: Whether it is said to undergo destruction or formation,

source: །ཆོས་དབྱིངས་ཡོད་ཅེའམ་མེད་ཅེས་ཐོས་གྱུར་ཀྱང་།
en: “And whether the dharmadhātu is said to exist or not exist,

source: །དུས་གསུམ་རྟོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ།
en: Bodhisattvas who know the three times

source: །ངེས་པར་སེམས་ཤིང་ཐམས་ཅད་རྣམ་དཔྱོད་དེ། །སངས་རྒྱས་ཆོས་འདིར་བསམ་པ་ཤིན་ཏུ་ངེས།
en: Think resolutely and investigate everything. Regarding this Buddhadharma, their thoughts are extremely firm.

source: །མཚན་མ་མེད་དང་མཚན་ཉིད་མེད་པ་དང་། །དངོས་མེད་རང་བཞིན་བརྫུན་ཞིང་དབེན་པ་དང་། །སྒྱུ་མའི་རང་བཞིན་མི་གཡོར་འདྲ་བ་ཡི། །ཆོས་མཆོག་ཞི་བ་འདི་འདྲ་ཉན་པར་བྱེད།
en: “They should thus learn this peaceful, highest of teachings: All phenomena are without phenomenal marks, without defining marks, The absence of entities, deceptive, isolated, Illusory, and like visual distortions.

source: །དེ་ལྟར་མི་ལྡོག་བྱང་ཆུབ་སེམས་དཔའ་ནི།
en: “Thus, irreversible bodhisattvas

source: །སངས་རྒྱས་ཆོས་དང་བྱང་ཆུབ་སེམས་དཔའ་དང་། །སྤྱོད་པ་ཡོད་དམ་མེད་ཅེས་ངེས་པར་དཔྱོད།
en: Investigate whether or not the Buddha, the Dharma, bodhisattvas, And bodhisattvas’ conduct exist.

source: །འབྱུང་ངམ་མི་འབྱུང་ཞེ་ནའང་ཕྱིར་མི་ལྡོག
en: They are also not deterred if asked whether these arise or do not.

source: །དེ་བཞིན་གཤེགས་པ་འདས་ཤེའམ་མ་འདས་ཤེའམ།
en: “They are not deterred if asked whether or not the Tathāgata has passed away,

source: །མ་བྱོན་ཅེའམ་མ་བྱོན་མ་ཡིན་ཞེའམ།
en: Or whether or not he has come into the world,

source: །བྱུང་ངམ་མ་བྱུང་ཟད་དམ་མི་ཟད་དམ།
en: Or whether or not he presently appears And, in either case, whether or not he fades away,

source: །དེ་བཞིན་མཚན་ཉིད་གཅིག་གམ་མཚན་ཉིད་མེད།
en: Or likewise whether he has one defining characteristic or none.

source: །གཅིག་དང་ཐ་དད་རྣམ་པ་མང་པོ་དང་། །དོན་དམ་ཚིག་འབྲུ་དངོས་དང་དངོས་མེད་པ། །ཐམས་ཅད་སྒྲོ་བཏགས་རྣམ་པ་གཞན་ཉིད་དུ། །མི་ལྡོག་བྱང་ཆུབ་སེམས་དཔའ་ཡིད་ཆེས་བྱེད།
en: “Irreversible bodhisattvas develop a conviction In the many aspects of sameness and difference, The existence and non-existence of meanings and words and syllables, And the other aspects of imputing everything.

source: །མཚན་མ་མེད་དང་མཚན་མ་ཡོད་པ་དང་། །མཚན་ཉིད་མེད་དང་མཚན་གྱིས་མཚོན་པ་དང་། །རྣམ་པར་ཕྱེ་བ་ཕན་ཚུན་སྦྱར་བ་རྣམས། །ཐོས་ནས་འདི་ལ་མཐར་ཐུག་འཇུག་པར་བྱེད།
en: “Having studied the reciprocal relations of such distinctions As the existence and non-existence of defining characteristics, And what is shown by characteristics and their absence, They progress toward the ultimate in these things.

source: །གཞོན་ནུར་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི།
en: “Bodhisattvas who are still youths

source: །ལུས་དང་ངག་དང་དེ་བཞིན་ཡིད་ཀྱིས་ཀྱང་། །འབྲས་བུ་ཡོད་པའི་ལས་རྣམས་བྱད་འགྱུར་ཞིང་།
en: Will perform bodily, verbal, and mental deeds That have karmic results,

source: །ཇི་ལྟར་འདོད་བཞིན་འདིར་ནི་སྐྱེ་བ་སྟོན།
en: And they can demonstrate rebirth here in any way they wish.

source: །ཕ་རོལ་རྣམས་ཀྱི་བསམ་པ་རྟོག་བྱེད་ཅིང་།
en: “They understand the thoughts of others

source: །དེ་དག་རྣམས་ཀྱི་མོས་པ་སྤྱོད་པར་བྱེད།
en: And help them to fulfill their aims.

source: །སེམས་ཅན་སྤྱོད་དང་རྗེས་སུ་འཐུན་ཆོས་དང་། །ཞིང་རྣམས་འཇིག་དང་ཆགས་པ་རྣམས་ཀྱང་ཤེས།
en: They know the conduct of sentient beings, the Dharma that befits them, And the realms that undergo destruction and formation.

source: །ཇི་ལྟར་འདོད་སྦྱིན་མྱུར་དུ་མངོན་ཤེས་ཐོབ།
en: “They quickly gain clairvoyance to grant any desires,

source: །ཕྱོགས་རྣམས་ཀུན་དུ་ཡིད་ནི་འཇུག་པར་བྱེད།
en: Engaging their mind in all directions.

source: །བདེ་གཤེགས་བསྔགས་པའི་ཆོས་རྣམས་ཐོས་ནས་ཀྱང་།
en: Having studied the teachings proclaimed by the Sugata,

source: །དེ་ལ་དེ་ནི་ནུར་བར་འགྱུར་བ་མེད།
en: They do not become displaced from them.

source: །ཡོངས་སུ་ཤེས་དང་ཞིང་གཡོ་བྱེད་པ་དང་།།དེ་བཞིན་བྱིན་གྱིས་བརླབ་དང་རྣམ་དཔྱོད་དང་། །ཇི་ལྟར་སྐད་ཅིག་གྲངས་མེད་འགྲོ་འགྱུར་བ།། ཞིང་དུ་འགྲོ་བར་བྱ་བ་བརྗོད་པར་བྱ།
en: “They should articulate comprehensive knowledge, how to move among buddhafields And likewise their blessings and analyses, How one instantaneously goes to the incalculable world systems, And the process of going to buddhafields.

source: །དེ་ནི་དྲི་བ་གྲངས་མེད་འདྲི་བར་བྱེད།
en: “They ask countless questions,

source: །ལུས་རྣམས་ཅི་འདྲར་ཡིད་ཀྱི་ལུས་ཀྱང་སྟོན།
en: Manifest a mental body that is like a normal body,

source: །དེ་ལ་སྒྲ་སྐད་སྦྱོར་བ་འབྱམ་ཀླས་དང་། །སྐད་ཅིག་ལ་ཡང་སངས་རྒྱས་གྲངས་མེད་བརྗོད།
en: Express the vast range of translations of words and languages, And instantaneously give expression to countless buddhas.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྒྱལ་ཚབ་གང་ཡིན་པ། །སེམས་ཅན་རྣམས་ཀྱི་འཇུག་པ་ཇི་བཞིན་ཤེས། །དེ་དག་ཉོན་མོངས་རྒྱུད་དང་བག་ཆགས་དང་། །སྤྱོད་ཡུལ་གང་ཡིན་སྦྱོར་བ་གང་ཡིན་དང་། །
en: “Bodhisattvas who are regents Know precisely the functioning of sentient beings. They are expert in understanding all beings’ defilements, mindstreams, latent tendencies, And their objects of experience and their engagements.

source: ཐ་དད་ཆོས་དང་རྒྱུ་བ་ཅི་འདྲ་དང་། །འཇིག་རྟེན་རྣམ་པར་ཕྱེ་དང་སྔོན་མཐའ་དང་། །བརྡ་ཡི་བདེན་དང་དོན་དམ་བདེན་པ་དག །མ་ལུས་རྟོགས་པར་བྱ་ལ་མཁས་པ་ཡིན།
en: “They are expert in everything to be understood: Differences in phenomena, diverse kinds of movements, Distinctions between worlds, the limits of the past, Language-dependent truth, and ultimate truth.

source: །ཕོ་བྲང་འཁོར་ལ་མཁས་པ་ཚང་འབྱིན་ཏེ།
en: “They have definitive expertise about the royal capital.

source: །དེར་ཡང་ཇི་ལྟར་ཀུན་དུ་སྤྱད་པ་དང་།
en: They know the modes of conduct there,

source: །གནས་དང་དེ་བཞིན་འཇུག་པར་བྱ་བ་དང་།
en: The residence and how things function therein,

source: །ཕོ་བྲང་འཁོར་ནི་ཅི་འདྲ་དཔྱད་པ་དང་།
en: And the investigation of what the royal capital is like.

source: །དམ་ཆོས་རྒྱལ་པོའི་དབང་བསྐུར་ཅི་འདྲ་དང་། །བྱིན་གྱི་རླབས་དང་གཞན་གནོན་ཅི་འདྲ་དང་།
en: “They understand how one is consecrated and blessed As a king of the true Dharma and how opponents are suppressed,

source: །ཆོས་ལ་འཇུག་དང་བཀའ་ལུང་བརྗོད་བྱ་སྟེ།
en: The entry into the Dharma, and the royal decrees to be expressed.

source: །འདི་ནི་རྒྱལ་ཚབ་ས་ལ་འཇུག་པ་ཡིན།
en: These are the functions of those on the stage of bodhisattvas who are regents.

source: །དེ་ཙམ་གྱིས་ན་དེ་ཡི་མཐར་ཐུག་སྟེ།
en: “Through these alone will one reach the ultimate;

source: །ཇི་སྐད་བསྟན་བཞིན་གཞན་དུ་འགྱུར་བ་མེད།
en: They do not become other than exactly what was taught.

source: །ཚེ་ཡི་འདུ་བྱེད་ནམ་ཞིག་འདོར་བ་ན།
en: And when a king one day abandons the formations that support life,

source: །ཚུལ་ལྡན་རྒྱལ་ཚབ་རྒྱལ་བར་མངོན་དུ་ཕྱོགས།
en: The principled regent will step forth in order to rule.

source: །དབང་བསྐུར་གང་ཡིན་བདེ་གཤེགས་སྲས་གཅིག་སྟེ།
en: “Bodhisattvas who have been consecrated are one kind of offspring of the Tathāgata;

source: །ཐུ་བོ་ཁྱད་འཕགས་མཐར་ཕྱིན་བདག་ཉིད་ཅན།
en: Their nature is to be extraordinary and perfected senior brothers.

source: །སྐྲ་ཐིགས་གཅིག་གིས་ཆུ་ཚད་གཟུང་དུ་རུང་།
en: Though the ocean’s volume might be measurable in single miniscule drops,

source: །འདིར་ནི་བསམ་པ་བགྲང་བས་རྟོགས་མ་ཡིན།
en: Their thinking is not fathomed by any measurement.

source: །རྒྱལ་སྲས་རྣམས་ཀྱི་སྤྱོད་པ་འདི་འདྲ་སྟེ།
en: “The conduct of the victors’ offspring is like this:

source: །འདི་ན་སེམས་ཅན་ལ་ལས་ཞིང་རྣམས་ཀུན། །ཕྲ་རབ་རྡུལ་དུ་རླགས་ནས་མ་ལུས་འགྲང་། །གྲངས་མེད་འདི་སྙེད་ཅིག་ཅེས་གཅོད་བྱེད་པ། །དེ་ཀུན་འདིར་ནི་བྱང་ཆུབ་སེམས་དཔས་ཤེས།
en: Here, were some sentient beings to pulverize all the worlds Into fine atoms and try to count them all, They will determine that they are countless in number, Yet the whole of that is known by bodhisattvas.

source: །འདས་དང་དེ་བཞིན་མ་བྱོན་སངས་རྒྱས་དང་། །གང་དག་ཕྱོགས་བཅུ་དག་ན་བཞུགས་པ་དང་། །རང་སངས་རྒྱས་དང་དེ་བཞིན་ཉན་ཐོས་ཀྱི། །ས་བོན་གྱུར་པ་བྱང་ཆུབ་སེམས་དེ་སྐྱེ།
en: “The thought of awakening that is born is the seed Of all past and future buddhas That exist in all directions And of pratyekabuddhas as well as śrāvakas.

source: །ཐོག་མར་བྱང་ཆུབ་སེམས་ཞེས་གང་བརྗོད་པ།
en: “That which is called the first thought of awakening

source: །དེ་ནི་ཇི་ལྟའི་ཚུལ་དུའང་གྲངས་མེད་དེ།
en: Is something that cannot be precisely fathomed.

source: །འཇིག་རྟེན་ཁམས་འདི་ཀུན་ཀྱང་ཁྱབ་གྱུར་ན།
en: And were it to pervade all the spheres of the world,

source: །དེ་ལས་གོང་དུ་བརྗོད་དུ་ཅི་ཞིག་ཡོད།
en: What more could be said than that?”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the bodhisattva Samanta­bhadra said to the bodhisattva Dharma­mati,

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་བཤད་པ་ལེགས་པར་སྨྲས་སོ།
en: “Son of a good family, your explanation of the dhāraṇī of the jewel torch was well expressed.

source: །རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་རྣམས་ནི་བསམ་གྱིས་མི་ཁྱབ་སྟེ།
en: Son of a good family, the qualities of a buddha are inconceivable.

source: གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཐོས་པའི་སེམས་ཅན་དེ་དག་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཉེ་བར་གྱུར་བ་ཡིན་ན། གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་དང་། ཀློག་པ་དང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། དེ་བཞིན་ཉིད་དུ་སྒྲུབ་པར་བྱེད་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ། དེ་དག་ནི་ངེས་པར་སངས་རྒྱས་སུ་འགྱུར་རོ།
en: Since all those sentient beings who hear the name of this Dharma discourse have approached omniscience, it goes without saying that those who maintain, read, and completely comprehend this Dharma discourse and realize suchness will surely become buddhas.”

source: །ཆོས་ཀྱི་བློ་གྲོས་ཀྱིས་སྨྲས་པ།
en: The bodhisattva Dharma­mati replied,

source: ཀྱེ་རྒྱལ་བའི་སྲས་དེ་དེ་བཞིན་ནོ།
en: “O son of the victors, so it is.

source: །ཇི་སྐད་སྨྲས་པ་བཞིན་ཏེ། ཤེས་རབ་ཟབ་མོ་དང་ལྡན་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་དབང་བསྐུར་བ་ཡིན་པར་རིག་པར་བྱའོ།
en: Just as you say, we should know that those who possess profound discriminating wisdom will be anointed by the Tathāgata.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོས་སྨྲས་པ།
en: The bodhisattva Samanta­bhadra said,

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གི་རྣ་ལམ་དུ་འདི་ལྟ་བུའི་ཆོས་འདི་དག་གྲག་པར་གྱུར་བའི་སྐྱེས་བུ་དམ་པ་དེ་དག་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་ལུང་བསྟན་པར་རིག་པར་བྱ་བ་ཡིན་ན། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གང་དག་གིས་ལག་ཏུ་ཐོབ་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: “And if those sons or daughters of good families—those sublime beings who have heard these renowned teachings—are to be understood as prophesied in the Buddha’s Dharma teachings, it goes without saying that those who actually hold this Dharma discourse in their hands should be too.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The elder Śāradvatī­putra then bowed to the Blessed One’s feet and said,

source: །བཅོམ་ལྡན་འདས་གཟིགས་སུ་གསོལ།
en: “Blessed One, please behold me.

source: བདག་གིས་འདི་ལྟ་བུའི་ཆོས་འདི་དག་མ་འཚལ་བས་བདག་ནི་དམུས་ལོང་དང་འདྲ་ལགས་སོ།
en: Since I do not understand such Dharma teachings as these, I am like a blind person.

source: །བཅོམ་ལྡན་འདས་བདག་གཅིག་པུ་དམུས་ལོང་ལྟ་བུར་གྱུར་པར་ཡང་མ་བས་ཀྱི།
en: Blessed One, not only am I like a blind person,

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་གང་དག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མ་ཐོས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དམུས་ལོང་ལྟ་བུར་གྱུར་པ་ལགས་སོ།
en: but all other sentient beings who have not heard this Dharma discourse are similarly blind.”

source: གནས་བརྟན་དེ་དེ་བཞིན་ཏེ།
en: “Elder, so it is,

source: ཇི་སྐད་སྨྲས་པ་བཞིན་ནོ།
en: just as you say.”

source: །ཤ་ར་དྭ་ཏིའི་བུས་གསོལ་པ།
en: Śāradvatī­putra said,

source: བཅོམ་ལྡན་འདས་ཀྱིས་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་བཤད་དུ་གསོལ།
en: “I ask that the Blessed One kindly explain the inconceivable.”

source: ཤ་ར་དྭ་ཏིའི་བུ་སོང་ལ་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་སྐུལ་ཅིག
en: “Śāradvatī­putra, go and encourage Indra, Brahmā, and the guardian deities of the world.

source: །དེ་བཞིན་གཤེགས་པའི་བཀའ་ཡང་སྒྲོགས་ཤིག
en: Tell them what the Tathāgata commands.

source: །ཆོས་ཀྱི་ཕྱག་རྒྱ་དམ་པ་དཀོན་མཆོག་ཏ་ལ་ལ་ཞེས་བྱ་བའི་གཟུངས་འདི་ཡང་འཁོར་དེར་སྒྲོགས་ཤིག
en: Inform that assembly that I will proclaim the holy Dharma seal of this dhāraṇī of the jewel torch!”
